# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1=pd.Series(np.random.randint(low=1,high=5,size=100))
s2=pd.Series(np.random.randint(low=1,high=4,size=100))
s3=pd.Series(np.random.randint(low=10000,high=30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df=pd.concat([s1,s2,s3],axis=1)
df

    0  1      2
0   3  1  12902
1   3  2  22237
2   3  1  20073
3   1  2  21746
4   2  1  15545
.. .. ..    ...
95  4  2  14230
96  4  2  26726
97  4  2  17156
98  2  3  14968
99  4  3  21457

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            12902
1      3       2            22237
2      3       1            20073
3      1       2            21746
4      2       1            15545

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
bigcolum=pd.DataFrame(pd.concat([s1,s2,s3]))
bigcolum

        0
0       3
1       3
2       3
3       1
4       2
..    ...
95  14230
96  26726
97  17156
98  14968
99  21457

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [9]:
len(bigcolum)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [11]:
bigcolum.reset_index(drop=True,inplace=True)
bigcolum

         0
0        3
1        3
2        3
3        1
4        2
..     ...
295  14230
296  26726
297  17156
298  14968
299  21457

[300 rows x 1 columns]